app/Controllers/Pages.php

SELECT *
FROM `home_banners`
WHERE `is_active` = 1
ORDER BY `sort_order` ASC
---
    public function home(): string
    {
        $bannerModel = new HomeBannerModel();
        $banners = $bannerModel
            ->where('is_active', 1)
            ->orderBy('sort_order', 'ASC')
            ->findAll();

SELECT *
FROM `portfolios`
WHERE `slug` = 'boggi-milano'
AND `is_active` = 1
 LIMIT 1
SELECT *
FROM `portfolios`
WHERE `is_active` = 1
AND   (
`sort_order` < 2
OR    (
`sort_order` = 2
AND `id` < 1
  )
 )
ORDER BY `sort_order` DESC, `id` DESC
 LIMIT 1
SELECT *
FROM `portfolios`
WHERE `is_active` = 1
AND   (
`sort_order` > 2
OR    (
`sort_order` = 2
AND `id` > 1
  )
 )
ORDER BY `sort_order` ASC, `id` ASC
 LIMIT 1
---
    public function projectDetail(string $slug): string
    {
        $portfolioModel = new PortfolioModel();
        $project = $portfolioModel
            ->where('slug', $slug)
            ->where('is_active', 1)
            ->first();

        if (!$project) {
            throw PageNotFoundException::forPageNotFound();
        }

        $projectSortOrder = (int)($project['sort_order'] ?? 0);
        $projectId = (int)($project['id'] ?? 0);

        $previousProject = $portfolioModel
            ->where('is_active', 1)
            ->groupStart()
                ->where('sort_order <', $projectSortOrder)
                ->orGroupStart()
                    ->where('sort_order', $projectSortOrder)
                    ->where('id <', $projectId)
                ->groupEnd()
            ->groupEnd()
            ->orderBy('sort_order', 'DESC')
            ->orderBy('id', 'DESC')
            ->first();

        $nextProject = $portfolioModel
            ->where('is_active', 1)
            ->groupStart()
                ->where('sort_order >', $projectSortOrder)
                ->orGroupStart()
                    ->where('sort_order', $projectSortOrder)
                    ->where('id >', $projectId)
                ->groupEnd()
            ->groupEnd()
            ->orderBy('sort_order', 'ASC')
            ->orderBy('id', 'ASC')
            ->first();